cmsis-svd/cmsis-svd/data/Microchip/PIC32CMxxxxMC00032.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>NVMCTRL</name>
         <version>039291a0</version>
         <description>Non-Volatile Memory Controller</description>
         <groupName>NVMCTRL</groupName>
         <prependToName>NVMCTRL_</prependToName>
         <baseAddress>0x41004000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x30</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>NVMCTRL</name>
            <value>6</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A</description>
               <addressOffset>0x0</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CMD</name>
                     <description>Command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                     <enumeratedValues>
                        <name>CMDSelect</name>
                        <enumeratedValue>
                           <name>ER</name>
                           <description>Erase Row - Erases the row addressed by the ADDR register.</description>
                           <value>0x02</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WP</name>
                           <description>Write Page - Writes the contents of the page buffer to the page addressed by the ADDR register.</description>
                           <value>0x04</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EAR</name>
                           <description>Erase Auxiliary Row - Erases the auxiliary row addressed by the ADDR register. This command can be given only when the security bit is not set and only to the user configuration row.</description>
                           <value>0x05</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WAP</name>
                           <description>Write Auxiliary Page - Writes the contents of the page buffer to the page addressed by the ADDR register. This command can be given only when the security bit is not set and only to the user configuration row.</description>
                           <value>0x06</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SF</name>
                           <description>Security Flow Command</description>
                           <value>0x0A</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WL</name>
                           <description>Write lockbits</description>
                           <value>0x0F</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DFER</name>
                           <description>Data Flash Erase Row - Erases the row addressed by the ADDR register.</description>
                           <value>0x1A</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DFWP</name>
                           <description>Data Flash Write Page - Writes the contents of the page buffer to the page addressed by the ADDR register.</description>
                           <value>0x1C</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LR</name>
                           <description>Lock Region - Locks the region containing the address location in the ADDR register.</description>
                           <value>0x40</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UR</name>
                           <description>Unlock Region - Unlocks the region containing the address location in the ADDR register.</description>
                           <value>0x41</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPRM</name>
                           <description>Sets the power reduction mode.</description>
                           <value>0x42</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CPRM</name>
                           <description>Clears the power reduction mode.</description>
                           <value>0x43</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PBC</name>
                           <description>Page Buffer Clear - Clears the page buffer.</description>
                           <value>0x44</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SSB</name>
                           <description>Set Security Bit - Sets the security bit by writing 0x00 to the first byte in the lockbit row.</description>
                           <value>0x45</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INVALL</name>
                           <description>Invalidate all cache lines.</description>
                           <value>0x46</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCEHL</name>
                           <description>Set Chip Erase Hard Lock (SCEHL) flash controller command</description>
                           <value>0x7f</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMDEX</name>
                     <description>Command Execution</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>CMDEXSelect</name>
                        <enumeratedValue>
                           <name>KEY</name>
                           <description>Execution Key</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLB</name>
               <description>Control B</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000080</resetValue>
               <fields>
                  <field>
                     <name>RWS</name>
                     <description>NVM Read Wait States</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>RWSSelect</name>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>Single Auto Wait State</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HALF</name>
                           <description>Half Auto Wait State</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DUAL</name>
                           <description>Dual Auto Wait State</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MANW</name>
                     <description>Manual Write</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLEEPPRM</name>
                     <description>Power Reduction Mode during Sleep</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SLEEPPRMSelect</name>
                        <enumeratedValue>
                           <name>WAKEONACCESS</name>
                           <description>NVM block enters low-power mode when entering sleep.NVM block exits low-power mode upon first access.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WAKEUPINSTANT</name>
                           <description>NVM block enters low-power mode when entering sleep.NVM block exits low-power mode when exiting sleep.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Auto power reduction disabled.</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>READMODE</name>
                     <description>NVM Read Mode</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>READMODESelect</name>
                        <enumeratedValue>
                           <name>NO_MISS_PENALTY</name>
                           <description>The NVM Controller (cache system) does not insert wait states on a cache miss. Gives the best system performance.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW_POWER</name>
                           <description>Reduces power consumption of the cache system, but inserts a wait state each time there is a cache miss. This mode may not be relevant if CPU performance is required, as the application will be stalled and may lead to increase run time.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DETERMINISTIC</name>
                           <description>The cache system ensures that a cache hit or miss takes the same amount of time, determined by the number of programmed flash wait states. This mode can be used for real-time applications that require deterministic execution timings.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CACHEDIS</name>
                     <description>Cache Disable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CACHEDISSelect</name>
                        <enumeratedValue>
                           <name>CACHE_DF_DIS_MAIN_EN</name>
                           <description>The Data Flash cache is disabled, the main array cache is enabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CACHE_DF_DIS_MAIN_DIS</name>
                           <description>The Data Flash cache is disabled, the main array cache is disabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CACHE_DF_EN_MAIN_EN</name>
                           <description>The Data Flash cache is enabled, the main array cache is enabled</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CACHE_DF_EN_MAIN_DIS</name>
                           <description>The Data Flash cache is enabled, the main array cache is disabled</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PARAM</name>
               <description>NVM Parameter</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NVMP</name>
                     <description>NVM Pages</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>PSZ</name>
                     <description>Page Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>PSZSelect</name>
                        <enumeratedValue>
                           <name>8</name>
                           <description>8 bytes</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16</name>
                           <description>16 bytes</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32</name>
                           <description>32 bytes</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>64</name>
                           <description>64 bytes</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>128</name>
                           <description>128 bytes</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>256</name>
                           <description>256 bytes</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>512</name>
                           <description>512 bytes</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1024</name>
                           <description>1024 bytes</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DFP</name>
                     <description>Data Flash Pages</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>READY</name>
                     <description>NVM Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERROR</name>
                     <description>Error Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>READY</name>
                     <description>NVM Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERROR</name>
                     <description>Error Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>READY</name>
                     <description>NVM Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>READYSelect</name>
                        <enumeratedValue>
                           <name>Val_0</name>
                           <description>The NVM controller is busy programming or erasing.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Val_1</name>
                           <description>The NVM controller is ready to accept a new command</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ERROR</name>
                     <description>Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ERRORSelect</name>
                        <enumeratedValue>
                           <name>Val_0</name>
                           <description>No errors have been received since the last clear</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Val_1</name>
                           <description>At least one error has occurred since the last clear</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status</description>
               <addressOffset>0x18</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>PRM</name>
                     <description>Power Reduction Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOAD</name>
                     <description>NVM Page Buffer Active Loading</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROGE</name>
                     <description>Programming Error Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKE</name>
                     <description>Lock Error Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NVME</name>
                     <description>NVM Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SB</name>
                     <description>Security Bit Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADDR</name>
               <description>Address</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>NVM Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>22</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LOCK</name>
               <description>Lock Section</description>
               <addressOffset>0x20</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>Region Lock Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PBLDATA0</name>
               <description>Page Buffer Load Data 0</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>PBLDATA</name>
                     <description>Page Buffer Load Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
